Repository: AmandoP/calliope-workbook1-nl
Catalog: omegat/project_save.tmx
Source language: de_de
Languages: nl

source: (parts per million)Teilchen in Millionen
nl: (parts per million)deeltjes per miljoen

source: 2x Kniebeugen
nl: 2x squats

source: 3 Orangen bereitlegen
nl: Zorg dat je 3 sinaasappels bij de hand hebt

source: 3x Hampelmann hintereinander
nl: 3 keer achter elkaar een sprongje

source: Setze die unten stehenden Bilder der Backanleitung in die richtige Reihenfolge, indem du sie von 1-5 durchnummerierst.
nl: Zet de onderstaande afbeeldingen van de bakinstructies in de juiste volgorde door ze te nummeren van 1 tot en met 5.

source: Starte den Simulator und beschreibe, was im Simulator passiert.
nl: Start de simulator en beschrijf wat er in de simulator gebeurt.

source: a) Bringe die einzelnen Schritte in die richtige Reihenfolge.
nl: a) Zet de afzonderlijke stappen in de juiste volgorde.

source: Tipp: Tippe Dauerhaft in die Suche ein!Lasse eine Rakete auf der LED-Matrix steigen.
nl: Tip: typ ‘Duurzaam’ in het zoekveld!Laat een raket opstijgen op de LED-matrix.

source: Verwende eine Variable, um die Geschwindigkeit deiner Animation zu bestimmen und bequem anzupassen.
nl: Gebruik een variabele om de snelheid van je animatie te bepalen en deze gemakkelijk aan te passen.

source: b) Kreise den Schritt ein, der wiederholt wird.
nl: b) Omcirkel de stap die herhaald wordt.

source: Verwende eine Variable um die Geschwindigkeit deiner Animation zu bestimmen und bequem anzupassen.
nl: Gebruik een variabele om de snelheid van je animatie te bepalen en deze gemakkelijk aan te passen.

source: Du musst wie ein Trickfilmprofi in Einzelbildern denken.Bringe die Befehle in die richtige Reihenfolge undlasse einen Countdown von 3-2-1-0 anzeigen.
nl: Je moet net als een animatieprofessional in afzonderlijke beelden denken.Zet de commando's in de juiste volgorde enlaat een aftelling van 3-2-1-0 weergeven.

source: Abfragen(ein-/zweifach)
nl: Vragen(enkelvoudig/dubbel)

source: Abfragen(mehrfach)
nl: Zoekopdrachten(meerdere)

source: Abschluss mit einem Strecksprung
nl: Afsluiting met een uitgestrekte sprongje

source: Alle 25 LEDs können rot leuchten.
nl: Alle 25 LED's kunnen rood oplichten.

source: Am besten funktioniert es, wenn du bekannte Symbole und Bezeichnungen verwendest.
nl: Het werkt het beste als je bekende symbolen en benamingen gebruikt.

source: Andere Wiederholungen sind an eine Bedingung oder ein anderes Ereignis geknüpft.
nl: Andere herhalingen zijn gekoppeld aan een voorwaarde of een andere gebeurtenis.

source: Anstatt immer wieder in jedem Pause Befehl die Geschwindigkeit zu ändern,kannst du es dir viel einfacher machen.
nl: In plaats van bij elke pauzecommando steeds weer de snelheid aan te passen,kun je het jezelf veel gemakkelijker maken.

source: Anstecken und Luftqualität messen!
nl: Aansluiten en de luchtkwaliteit meten!

source: Anweisung
nl: Instructies

source: Anweisungen
nl: Instructies

source: Auch die Farbe und Anordnung einiger Bauteile hat sich leicht geändert.
nl: Ook de kleur en de plaatsing van enkele onderdelen zijn enigszins veranderd.

source: Auf Seite 58 findest du eine Anleitung, wie du mit einem mobilen Gerät programmierst.
nl: Op pagina 58 vind je een handleiding voor het programmeren met een mobiel apparaat.

source: Auf dem Monitor ...
nl: Op het scherm ...

source: Aus dem Lautsprecher ...
nl: Uit de luidspreker ...

source: Ausgabe
nl: Uitgave

source: Ausgegeben wird die Helligkeit im Wertebereich 0 (dunkel) - 255 (hell).
nl: De helderheid wordt weergegeven op een schaal van 0 (donker) tot 255 (licht).

source: Autorin und Autor:Franka FutterliebAmando PascottoJørn AlraunBegleitendes Zusatzmaterial inklusive Leitfäden für den Unterricht, Programmcodes und Lösungen können auf der Webseite aufgerufen werden: calliope.cc/schulen/arbeitsheft
nl: Auteurs:Franka FutterliebAmando PascottoJørn AlraunAanvullend materiaal, waaronder lesgidsen, programmacodes en oplossingen, is te vinden op de website: calliope.cc/schulen/arbeitsheft

source: BASTELN
nl: KNUTSELEN

source: Bausteine eines Computers
nl: Onderdelen van een computer

source: Bearbeite die folgenden Aufgaben in MakeCode:
nl: Voer de volgende opdrachten uit in MakeCode:

source: Beim Programmieren werden Algorithmen, die der Computer ausführen soll, in Programme übersetzt, die der Computer versteht.
nl: Bij het programmeren worden algoritmen die de computer moet uitvoeren, vertaald naar programma's die de computer begrijpt.

source: Beim Start erscheint ein Herz auf der LED-Matrix.Lasse „Ich Berlin!“ über die LED-Matrix laufen.Lasse dauerhaft ein Herz auf der LED-Matrix blinken.
nl: Bij het opstarten verschijnt er een hart op de LED-matrix.Laat „Ich Berlin!“ over de LED-matrix lopen.Laat een hart continu knipperen op de LED-matrix.

source: Beim Start erscheint ein Herz auf der LED-Matrix.Lasse „Ich liebe Berlin!“ über die LED-Matrix laufen.Lasse dauerhaft ein Herz auf der LED-Matrix blinken.Tipp: Tippe Dauerhaft in die Suche ein!Lasse eine Rakete auf der LED-Matrix steigen.Tipp: Jetzt musst du denken, wie ein Trickfilmprofi- in Einzelbildern!Bring die Programmblöcke in die richtige Reihenfolgeund lass einen Countdown von 3-2-1-0 anzeigen.a) Füge hinter jeder Zahl eine Pause ein.b) Verlängere die Pausen indem du den Wert der Millisekunden (MS) erhöhst.c) Speichere dein Programm unter dem Namen „Raketenstart“.
nl: Bij het opstarten verschijnt er een hart op de LED-matrix.Laat „Ik hou van Berlijn!“ over de LED-matrix lopen.Laat een hart continu op de LED-matrix knipperen.Tip: Typ ‘Duur’ in de zoekbalk!Laat een raket opstijgen op de LED-matrix.Tip: Nu moet je denken als een animatieprofessional- in afzonderlijke beelden!Zet de programmablokken in de juiste volgordeen laat een aftelling van 3-2-1-0 weergeven.a) Voeg achter elk getal een pauze in.b) Verleng de pauzes door de waarde in milliseconden (ms) te verhogen.c) Sla je programma op onder de naam „Raketlancering“.

source: Benenne dein Programm und klicke auf “Herunterladen”.
nl: Geef je programma een naam en klik op ‘Downloaden’.

source: Benenne dein Programm und klicke auf „Herunterladen”.
nl: Geef je programma een naam en klik op ‘Downloaden’.

source: Betrachte deinen Calliope mini.
nl: Kijk eens naar je Calliope mini.

source: Bringe die einzelnen Schritte in die richtige Reihenfolge.Kreise die Schritte ein, die wiederholt werden.
nl: Zet de afzonderlijke stappen in de juiste volgorde.Omcirkel de stappen die herhaald worden.

source: CO2-Sensor
nl: CO₂-sensor

source: Dabei spielt die Reihenfolge der Anweisungen eine entscheidende Rolle.
nl: Daarbij speelt de volgorde van de instructies een doorslaggevende rol.

source: Dafür werden klare und detaillierte Anweisungen benötigt, die nacheinander ausgeführt werden.
nl: Hiervoor zijn duidelijke en gedetailleerde instructies nodig, die stap voor stap moeten worden uitgevoerd.

source: Damit alle Personen aus deinem Team Nachrichten senden und empfangen können, übertrage jeweils den gesamten Programmcode auf alle Calliope mini in deinem Team.
nl: Zorg ervoor dat je de volledige programmacode naar alle Calliope mini’s in je team overbrengt, zodat iedereen in je team berichten kan verzenden en ontvangen.

source: Damit der Calliope mini deine Anweisungen versteht, müssen diese in der passenden Sprache geschrieben werden.
nl: Om ervoor te zorgen dat de Calliope mini je instructies begrijpt, moeten deze in de juiste taal zijn geschreven.

source: Danach erscheint die Funk Kategorie in deiner Bibliothek.
nl: Daarna verschijnt de Funk -categorie in je bibliotheek.

source: Das Drücken des Knopfes A löstdas Senden der Nachricht aus.
nl: Als je op knop A drukt, wordthet bericht verzonden.

source: Das Programm wird zunächst als .hex-Datei im Download-Ordner gespeichert.
nl: Het programma wordt eerst als .hex-bestand in de downloadmap opgeslagen.

source: Dazu brauchst du eine Programmierumgebung - auch Editor genannt.Eine passende Programmierumgebung ist der Editor MakeCode.Du findest ihn unter folgender Internetadresse:
nl: Daarvoor heb je een programmeeromgeving nodig – ook wel editor genoemd.Een geschikte programmeeromgeving is de editor MakeCode.Je vindt deze op het volgende internetadres:

source: Definiere 5 Farben und ordne jeder Farbe eine Fitnessübung zu - zum Beispiel Kniebeugen, Strecksprung, Hampelmann etc.
nl: Kies 5 kleuren en koppel aan elke kleur een fitnessoefening – bijvoorbeeld squats, sprong met strekbeweging, hink-stap-sprong enz.

source: Deine bearbeiteten Projekte findest du auf der Startseite unter „Meine Projekte“.
nl: Je bewerkte projecten vind je op de startpagina onder „Mijn projecten“.

source: Den Calliope mini steuern
nl: De Calliope mini bedienen

source: Den Inhalt des Rucksacks kannst du ändern und über den Namen des Rucksacks abfragen.
nl: Je kunt de inhoud van de rugzak wijzigen en deze opvragen via de naam van de rugzak.

source: Der Calliope mini
nl: De Calliope mini

source: Der Calliope mini besitzt eine kleine Antenne, über die Nachrichten zwischen verschiedenen Calliope mini übermittelt werden können.
nl: De Calliope mini heeft een kleine antenne waarmee berichten tussen verschillende Calliope mini's kunnen worden verzonden.

source: Der Calliope mini kann über den Lautsprecher Töne ausgeben.
nl: De Calliope mini kan geluiden weergeven via de luidspreker.

source: Der Computer ...
nl: De computer ...

source: Der Computer benötigt diese klaren, eindeutigen Anweisungen.
nl: De computer heeft deze duidelijke, eenduidige instructies nodig.

source: Der Inhalt der Variable „receivedString“wird auf der LED-Matrix angezeigt.
nl: De inhoud van de variabele „receivedString“wordt weergegeven op de LED-matrix.

source: Der Programmbereich kann auch als Bühne angesehen werden, hier entwickelst du dein Programm, in dem du die einzelnen Programmblöcke platzierst.
nl: Het programmagedeelte kan ook als een podium worden beschouwd; hier ontwikkel je je programma door de afzonderlijke programmablokken te plaatsen.

source: Der Text wird über Funk empfangen.
nl: De tekst wordt via de radio ontvangen.

source: Die .hex Datei lässt sich wieder in MakeCode öffnen und bearbeiten.
nl: Het .hex-bestand kan weer in MakeCode worden geopend en bewerkt.

source: Die Funkgruppe wird auf „1“ gestellt.
nl: De radio wordt op „1“ gezet.

source: Die Knöpfe (Taster) funktionieren, wie die Tasten auf einer Tastatur.
nl: De knoppen (drukknoppen) werken net als de toetsen op een toetsenbord.

source: Die LED-Matrix beim Calliope mini ist gleichzeitig auch der Lichtsensor, mit dem die Stärke des Umgebungslichts gemessen werden kann.
nl: De LED-matrix van de Calliope mini fungeert tegelijkertijd ook als lichtsensor, waarmee de intensiteit van het omgevingslicht kan worden gemeten.

source: Die LED-Matrix ist der Bildschirm des Calliope mini.
nl: De LED-matrix is het scherm van de Calliope mini.

source: Die Sammlung dieser Handlungsanweisungen wird Programm oder Algorithmus genannt.In deinem Alltag gibt es viele Abläufe, die du hintereinander ausführst und bei denen du auf die Reihenfolge achten musst.
nl: De verzameling van deze instructies wordt een programma of algoritme genoemd.In je dagelijks leven zijn er veel handelingen die je achter elkaar uitvoert en waarbij je op de volgorde moet letten.

source: Die Touch-Pins ermöglichen es, mit den Fingern einen Schaltkreis zu schließen.
nl: Met de touch-pinnen kun je met je vingers een stroomkring sluiten.

source: Die Touch-Pins reagieren auf Berührung und lösen so - wie die Knöpfe - Befehle aus.
nl: De touch-pins reageren op aanraking en activeren zo – net als de knoppen – opdrachten.

source: Diese Farben werden aus den drei Grundfarben rot, grün, blau gemischt.
nl: Deze kleuren worden gemengd uit de drie basiskleuren rood, groen en blauw.

source: Dort steht rechts neben dem USB-Anschluss die Versionsnummer.
nl: Daar staat rechts naast de USB-aansluiting het versienummer.

source: Drücke die weiße Reset Taste auf deinem Calliope mini, um dein Programm auszuführen.
nl: Druk op de witte resetknop op je Calliope mini om je programma uit te voeren.

source: Drücke die weiße Reset Taste auf deinem Calliope mini, um dein Programm erneut zu starten.
nl: Druk op de witte resetknop op je Calliope mini om je programma opnieuw te starten.

source: Du findest ihn in der Logik Kategorie.
nl: Je vindt het in de categorie ‘Logica’.

source: Du kannst die Projekte im Arbeitsheft mit allen Calliope mini Versionen umsetzen.
nl: Je kunt de projecten in het werkboek uitvoeren met alle versies van de Calliope mini.

source: Du kannst diesen Link speichern oder mit anderen teilen.
nl: Je kunt deze link opslaan of met anderen delen.

source: Du kannst ein Programm mit einem Rezept vergleichen.
nl: Je kunt een programma vergelijken met een recept.

source: Du kannst ihn einfach anklicken und an die gewünschte Stelle ziehen.
nl: Je kunt er gewoon op klikken en het naar de gewenste plek slepen.

source: Du kannst jederzeit die Version anpassen.
nl: Je kunt de versie op elk moment aanpassen.

source: Du kannst mit Krokodilklemmen die Touch-Pins verlängern.Probiere unterschiedliche Materialien aus… Aluminium, Banane, Knete, Besteck.
nl: Je kunt de touch-pinnen verlengen met krokodillenklemmen.Probeer eens verschillende materialen uit… aluminium, banaan, klei, bestek.

source: Du kannst sie nicht umbenennen, aber jederzeit innerhalb der „Empfangen“-Funktion verwenden.
nl: Je kunt ze niet hernoemen, maar je kunt ze op elk moment gebruiken binnen de functie ‘Ontvangen’.

source: Du möchtest ein leckeres Marmeladenbrot zum Frühstück?Bringe die Anweisungen in die richtige Reihenfolge.
nl: Wil je een lekker broodje met jam als ontbijt?Zet de instructies in de juiste volgorde.

source: Durch Mischen der Farben können viele Farben angezeigt werden.
nl: Door de kleuren te mengen, kunnen veel verschillende kleuren worden weergegeven.

source: Durch einen Klick auf das Speichern-Symbolkannst du dein Programm als .hex Datei speichern.
nl: Door op het opslagpictogramte klikken, kun je je programma opslaan als een .hex-bestand.

source: Ein Algorithmus ist eine Verarbeitungsvorschrift mit eindeutig ausführbaren Anweisungen.
nl: Een algoritme is een verwerkingsvoorschrift met eenduidige, uitvoerbare instructies.

source: Ein Computersystem besteht aus vielen Bauteilen, kennst du sie?Einige dieser Bauteile sind auch auf dem Calliope mini zu finden.
nl: Een computersysteem bestaat uit veel onderdelen, ken je ze?Sommige van deze onderdelen zijn ook op de Calliope mini te vinden.

source: Ein Plan hilft dir bei der Umsetzung deiner Idee und ist nützlich, damit du den Überblick bewahrst.
nl: Een plan helpt je bij het uitvoeren van je idee en is handig om het overzicht te behouden.

source: Ein Text wird über Funk gesendet.
nl: Een tekst wordt via de radio verzonden.

source: Ein neues Projekt startenKlicke auf die türkise Schaltfläche mit dem großen „+“ Zeichen.
nl: Een nieuw project startenKlik op de turquoise knop met het grote „+“-teken.

source: Eine RGB-LED kann in ganz unterschiedlichen Farben leuchten.
nl: Een RGB-led kan in heel verschillende kleuren oplichten.

source: Eine Variable ist wie ein Rucksack mit Namensschild, den du immer dabei hast und der jederzeit den Inhalt bereithält.
nl: Een variabele is als een rugzak met een naamplaatje, die je altijd bij je hebt en die op elk moment de inhoud bij de hand heeft.

source: Einfach anschließen und den CO2 Gehalt, die Temperatur und die Luftfeuchtigkeit messen.
nl: Gewoon aansluiten en het CO₂-gehalte, de temperatuur en de luchtvochtigheid meten.

source: Eingabe
nl: Invoer

source: Entscheidung/Abfrage
nl: Beslissing/Vraag

source: Entwickle ein Calliope mini Klavier, das beim Berühren der Touch-Pins 0-3 jeweils eine unterschiedliche Note abspielt, die RGB-LED in verschiedenen Farben leuchten lässt und den Notennamen auf der LED-Matrix anzeigt.
nl: Ontwikkel een Calliope mini-piano die bij het aanraken van de touch-pinnen 0-3 telkens een andere noot laat klinken, de RGB-LED in verschillende kleuren laat oplichten en de naam van de noot op de LED-matrix weergeeft.

source: Er befindet sich unter dem B-Knopf genau neben dem Touch-Pin mit der Nummer 3.
nl: Deze bevindt zich onder de B-knop, precies naast de touch-pin met nummer 3.

source: Ergebnis
nl: Resultaat

source: Ergänze das Struktogramm um zwei Entscheidungen und formuliere passende Anweisungen.
nl: Vul het structogram aan met twee beslissingen en formuleer bijbehorende instructies.

source: Ergänze das Struktogramm und füge die einzelnen Schritte in der richtigen Reihenfolge des Saftmachens hinzu.• Hälften auspressen• 3 Mal wiederholen• Orange in der Mitte durchschneiden
nl: Vul het structogram aan en voeg de afzonderlijke stappen toe in de juiste volgorde voor het maken van sap.• De helften uitpersen• Dit 3 keer herhalen• De sinaasappel in het midden doormidden snijden

source: Erstelle das abgebildete Programm.
nl: Maak het afgebeelde programma.

source: Erstelle dazu folgende Programme in MakeCode.
nl: Maak hiervoor de volgende programma's in MakeCode.

source: Erstelle dazu folgende Programme in MakeCode.Starte den Simulator und beschreibe, was im Simulator passiert.
nl: Maak hiervoor de volgende programma's in MakeCode.Start de simulator en beschrijf wat er in de simulator gebeurt.

source: Erstelle den Programmcode anhand des abgebildeten Struktogramms.
nl: Maak de programmacode aan de hand van het afgebeelde structogram.

source: Erstelle ein Fitnessprogramm!
nl: Stel een fitnessprogramma samen!

source: Erstelle ein Programm, das dauerhaft die Helligkeit misst und diese über dieLED-Matrix ausgibt.Miss die Umgebungslichtstärke an unterschiedlichen Orten und dokumentiere die gemessenen Werte.
nl: Maak een programma dat continu de helderheid meet en deze via deLED-matrix weergeeft.Meet de omgevingshelderheid op verschillende locaties en leg de gemeten waarden vast.

source: Erstelle ein Programm, mit dem du nach Belieben unterschiedliche Nachrichten übertragen kannst.
nl: Maak een programma waarmee je naar believen verschillende berichten kunt verzenden.

source: Erstelle ein Struktogramm anhand des Programmcodes.
nl: Maak een structogram op basis van de programmacode.

source: Erstelle ein Struktogramm und beachte bei deinem Fitnessprogramm folgende Vorgaben:
nl: Maak een structogram en houd bij je fitnessprogramma rekening met de volgende richtlijnen:

source: Erstelle ein Struktogramm, um einen Regenbogen zu programmieren.Verwende dazu folgende Farben: rot, orange, gelb, grün, türkis, blau, lila.
nl: Maak een structogram om een regenboog te programmeren.Gebruik daarvoor de volgende kleuren: rood, oranje, geel, groen, turkoois, blauw, paars.

source: Erstelle ein eigenes Struktogramm für das Überqueren einer Straße.Verwende folgende Beschreibungen der einzelnen Schritte.• Ich gehe zur Ampel.• Ich überprüfe das Ampelsignal.• Ist das Signal der Ampel grün?• Ich überquere die Straße.• Ich bleibe stehen.
nl: Maak een eigen structogram voor het oversteken van een straat.Gebruik de volgende beschrijvingen van de afzonderlijke stappen.• Ik loop naar het verkeerslicht.• Ik kijk naar het verkeerslicht.• Is het verkeerslicht op groen?• Ik steek de straat over.• Ik blijf staan.

source: Erstelle folgende Programme in MakeCode:
nl: Maak de volgende programma's in MakeCode:

source: Erstelle folgendes Programm in MakeCode:
nl: Maak het volgende programma in MakeCode:

source: Erweitere dein Programm:
nl: Breid je programma uit:

source: Es gibt Abläufe, die durch getroffene Entscheidungen unterschiedlich verlaufen.Verbinde die Bedingungen (wenn) mit der passenden Entscheidung (dann).
nl: Er zijn processen die, afhankelijk van de genomen beslissingen, op verschillende manieren verlopen.Koppel de voorwaarden (als) aan de juiste beslissing (dan).

source: Es kann über verschiedene Funkgruppen, die in der Programmierung festgelegt werden, gefunkt werden.
nl: Er kan via verschillende radiogroepen worden gecommuniceerd, die tijdens de programmering worden ingesteld.

source: Es lassen sich Texte, Symbole und sogar Animationen anzeigen.
nl: Er kunnen teksten, symbolen en zelfs animaties worden weergegeven.

source: Finde eine Bezeichnung für den Ort und notiere die Messung in Wert 1.
nl: Zoek een naam voor de plaats en noteer de meetwaarde in veld 1.

source: Formuliere fünf Anweisungen, die den Ablauf des Zähneputzens beschreiben.
nl: Formuleer vijf instructies die beschrijven hoe het tandenpoetsen in zijn werk gaat.

source: Funken
nl: Vonken

source: Futter in den Napf füllen
nl: Voer in de voerbak doen

source: Füge beiden Symbolen noch eine passende Farbe hinzu und teste das Projekt auf deinem Calliope mini.
nl: Geef beide symbolen nog een passende kleur en test het project op je Calliope mini.

source: Führe dafür die folgenden zwei Schritte aus:
nl: Voer hiervoor de volgende twee stappen uit:

source: Führe die einzelnen Schritte in der richtigen Reihenfolge aus und teste auf deinem Calliope mini.
nl: Voer de afzonderlijke stappen in de juiste volgorde uit en test het resultaat op je Calliope mini.

source: Führe die einzelnen Schritte in der richtigen Reihenfolge aus und teste sie auf deinem Calliope mini.
nl: Voer de afzonderlijke stappen in de juiste volgorde uit en test ze op je Calliope mini.

source: Gehe schrittweise vor!
nl: Ga stap voor stap te werk!

source: Geschrieben wird ...
nl: Er wordt geschreven ...

source: Gib den Programmcode korrigiert ein.
nl: Voer de programmacode in de juiste vorm in.

source: Gib die URL in die Browserleiste ein - makecode.calliope.cc
nl: Voer de URL in de adresbalk van de browser in - makecode.calliope.cc

source: Hacken
nl: Hakken

source: Halte den Calliope mini mit einer Hand amMinus (-) Pin fest und berühre mit einem Finger der anderen Hand einen der anderen Pins.
nl: Houd de Calliope mini met één hand vast bij deminus (-)-pin en raak met een vinger van je andere hand een van de andere pinnen aan.

source: Hardware auswählenWähle zu Beginn eines neuen Projekts deine Calliope mini Version aus.
nl: Hardware selecterenKies aan het begin van een nieuw project je Calliope mini-versie.

source: Hier hast du Platz für die Struktogramme von Aufgabe 2 und 3.
nl: Hier is ruimte voor de structogrammen van opgave 2 en 3.

source: Hier ist Platz für dein Struktogramm:
nl: Hier is ruimte voor je structogram:

source: Hier ist etwas durcheinander geraten.
nl: Er is hier iets in de war geraakt.

source: Hier kannst du dein Programm benennen, speichern und übertragen.
nl: Hier kun je je programma een naam geven, opslaan en verzenden.

source: Hier kannst du deine Eingabe noch genauer definieren.
nl: Hier kun je je invoer nog nauwkeuriger specificeren.

source: Hier siehst du ein Struktogramm, das den Ablauf des Hundefütterns darstellt.Schau dir die einzelnen Anweisungen an und kreise die Entscheidung ein.
nl: Hier zie je een structogram dat het verloop van het voeren van de hond weergeeft.Bekijk de afzonderlijke instructies en omcirkel de keuze.

source: Hier siehst du eine Abbildung des Calliope mini.
nl: Hier zie je een afbeelding van de Calliope mini.

source: Hilfe:Der „receivedString“ - Block speichert die empfangene Nachricht.
nl: Help:Het „receivedString“-blok slaat het ontvangen bericht op.

source: Hilfe:Für die Abfrage der empfangenen Zahl wird ein Vergleichsblock benötigt.
nl: Help:Om het ontvangen getal op te vragen, is een vergelijkingsblok nodig.

source: Hilfe:Mit Krokodilklemmen kannst du Gegenstände wie z.B. Aluminiumfolie, Knete oder eine Zitrone mit den Touch-Pins verbinden.
nl: Hulp:Met krokodillenklemmen kun je voorwerpen zoals aluminiumfolie, klei of een citroen aan de touch-pinnen bevestigen.

source: Hinweis: Ab dem Calliope mini 3 gibt es drei RGB-LEDs.
nl: Opmerking: Vanaf de Calliope mini 3 zijn er drie RGB-leds.
